{
  "backend/main.mo": "Defines user profiles, workout and weight record types, calendar keys, and stores workout/weight data with access-controlled update functions.",
  "feature_evidence.json": "Lists feature evidence tying new workout progress chart and data hook features to related frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend components, screens, and utilities used across the app.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React app component configuring providers, onboarding flow, navigation, and screen rendering.",
  "frontend/src/components/AppHeader.tsx": "Header component showing app branding, user name, help button, theme toggle, and auth controls.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, main content area, and bottom navigation.",
  "frontend/src/components/AsyncState.tsx": "Utility component displaying loading, error, empty, or content states.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button integrating with Internet Identity and clearing query cache on logout.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar switching between four main app tabs.",
  "frontend/src/components/CompletionToggle.tsx": "Button for marking a workout complete for a given date with skip-state handling and auth gating.",
  "frontend/src/components/DateSelector.tsx": "Provides UI controls to navigate days and pick a date using buttons and a calendar popover.",
  "frontend/src/components/DietEditDialog.tsx": "Dialog for editing daily meal overrides with fields for meal details and actions to save or reset.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays an alert when an error occurs and offers a page reload option.",
  "frontend/src/components/ExerciseCard.tsx": "Displays exercise details and includes a rest timer with start, pause, and reset controls.",
  "frontend/src/components/GoalSetupDialog.tsx": "Dialog for setting or updating user fitness goals such as weight, frequency, and duration.",
  "frontend/src/components/MealDayDetail.tsx": "Shows meal details for a day including type, nutrition info, and an illustration.",
  "frontend/src/components/OnboardingTourDialog.tsx": "Introductory dialog explaining app sections with icons and options to dismiss or revisit later.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter a name and creates an initial profile.",
  "frontend/src/components/ProteinScoopsTracker.tsx": "Card to track daily protein scoop intake with increment/decrement controls and status display.",
  "frontend/src/components/RequireAuthNotice.tsx": "Shows an alert prompting users to sign in if no identity is detected.",
  "frontend/src/components/SafetyDisclaimer.tsx": "Displays workout or diet safety guidance based on the provided type.",
  "frontend/src/components/SkipDayToggle.tsx": "Provides a button to skip or unskip a workout or diet day, requiring user identity.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/components/WaterGlassesTracker.tsx": "Tracks daily water intake with increment and decrement controls tied to backend state.",
  "frontend/src/components/WaterReminderSettings.tsx": "Allows enabling and scheduling a daily water reminder, storing settings locally.",
  "frontend/src/components/WeeklyDayPicker.tsx": "Renders buttons for selecting a weekday index from Monday to Sunday.",
  "frontend/src/components/WeighInForm.tsx": "Form dialog to add a new weight entry with async submission.",
  "frontend/src/components/WeighInList.tsx": "Displays recent weight entries with loading and empty-state handling.",
  "frontend/src/components/WeightChart.tsx": "Renders a lightweight SVG line chart for the last 10 weight entries.",
  "frontend/src/components/WorkoutDayDetail.tsx": "Shows details for a workout day, supporting skipped state and exercise sections.",
  "frontend/src/components/WorkoutEditDialog.tsx": "Dialog for editing a specific day's workout, allowing section and exercise management.",
  "frontend/src/components/WorkoutProgressChart.tsx": "Generates a completion heatmap for a date range and summarizes completion stats.",
  "frontend/src/data/mealPlan.ts": "Defines a Meal interface and exports a multi-day meal plan array with nutritional details.",
  "frontend/src/data/workoutPlan.ts": "Defines workout-related interfaces and exports a structured multi-day intermediate workout plan.",
  "frontend/src/hooks/queries/queryKeys.ts": "Provides centralized React Query keys for user, workout, diet, water, and protein data.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Fetches the current user profile via an actor with React Query, handling loading and availability states.",
  "frontend/src/hooks/queries/useDietSkip.ts": "Manages diet-skip status per date using localStorage with query and mutation hooks.",
  "frontend/src/hooks/queries/useProteinScoops.ts": "Handles reading and updating protein scoop counts per date using local storage utilities.",
  "frontend/src/hooks/queries/useUserGoals.ts": "Provides mutations for saving and updating user profile goals via actor methods.",
  "frontend/src/hooks/queries/useWaterGlasses.ts": "Reads and updates daily water glass counts using local storage through React Query hooks.",
  "frontend/src/hooks/queries/useWeightEntries.ts": "Fetches weight entries and latest weight, and adds new weight entries via actor mutations.",
  "frontend/src/hooks/queries/useWorkoutCompletion.ts": "Manages workout completion records, stats, and date-specific completion toggles through actor-based queries and mutations.",
  "frontend/src/hooks/queries/useWorkoutForDate.ts": "Provides hooks to fetch, save, and reset workouts for a date, handling custom overrides and default plan logic.",
  "frontend/src/hooks/queries/useWorkoutSkip.ts": "Hooks to get, toggle, and set whether a workout was skipped for a date, with related cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor tied to the current identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useDietOverrides.ts": "Manages diet plan overrides per date using localStorage, with hooks to fetch, save, and reset meals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context for Internet Identity, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useIntervalTimer.ts": "Implements a countdown timer hook with start, pause, reset, and progress tracking.",
  "frontend/src/hooks/useOnboardingTour.ts": "Controls onboarding modal visibility using localStorage to persist dismissed state.",
  "frontend/src/hooks/useWaterReminder.ts": "Runs a periodic check to show water reminders via toast and notifications at a specified daily time.",
  "frontend/src/index.css": "Tailwind and custom CSS variables defining theme colors, dark mode, and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/screens/DietScreen.tsx": "Renders the diet screen with date selection, skip toggling, water/protein trackers, meal details, and an edit dialog using diet-related hooks.",
  "frontend/src/screens/HomeScreen.tsx": "Displays user goals, workout stats, latest weight, and allows editing goals with authentication and async data loading.",
  "frontend/src/screens/ProgressScreen.tsx": "Shows workout and weight progress charts, a weigh‑in list, and a form to add entries, pulling data for a 30‑day range.",
  "frontend/src/screens/WorkoutScreen.tsx": "Displays workout details for a selected date with edit capability, authentication checks, and loading skeletons.",
  "frontend/src/utils/date.ts": "Provides date formatting, parsing, arithmetic, and weekday mapping utilities.",
  "frontend/src/utils/trackerStorage.ts": "Handles localStorage read/write for water glasses and protein scoops using per‑user/date keys with anonymous fallback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and managing hash‑based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugin extensions for typography, container queries, and animations.",
  "project_state.json": "JSON project state describing app summary, architecture notes, issues, and feature requests related to workout progress tracking and charting."
}