{
  "backend/main.mo": "Actor module defining user profiles, workouts, calendar keys, and storage maps with authorization checks and update functions.",
  "feature_evidence.json": "Feature evidence report listing added water/protein trackers and related frontend files with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components and screens used across the app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "Base HTML document mounting the app root and loading the main React entry file.",
  "frontend/src/App.tsx": "Root React component configuring theme, query client, tabs, and main screens.",
  "frontend/src/components/AppHeader.tsx": "Header showing app branding, user name, theme toggle, and auth button.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper combining header, main content area, and bottom navigation.",
  "frontend/src/components/AsyncState.tsx": "Utility component handling loading, error, and empty states for async data.",
  "frontend/src/components/AuthButton.tsx": "Button handling Internet Identity login/logout and clearing React Query cache.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar switching between app tabs with icons.",
  "frontend/src/components/CompletionToggle.tsx": "Button to toggle workout completion for a date, handling skip state and auth constraints.",
  "frontend/src/components/DateSelector.tsx": "Provides a date picker with previous/next day buttons and a popover calendar for selecting a date.",
  "frontend/src/components/DietEditDialog.tsx": "Dialog for editing and saving per‑day meal overrides, allowing meal fields and settings to be updated or reset.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches rendering errors and displays a reloadable error alert instead of the crashed UI.",
  "frontend/src/components/ExerciseCard.tsx": "Displays exercise details and includes a rest‑timer with start, pause, and reset controls.",
  "frontend/src/components/GoalSetupDialog.tsx": "Dialog for setting or updating user goal parameters like weight, workout frequency, and duration.",
  "frontend/src/components/MealDayDetail.tsx": "Shows detailed meal cards for a day including nutrition info and veg/non‑veg status.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter their name and creates a default profile.",
  "frontend/src/components/ProteinScoopsTracker.tsx": "Tracks and updates daily protein scoop count with increment/decrement controls.",
  "frontend/src/components/RequireAuthNotice.tsx": "Displays a sign‑in prompt alert when the user is not authenticated.",
  "frontend/src/components/SafetyDisclaimer.tsx": "Shows a safety disclaimer for either workouts or diet with predefined text.",
  "frontend/src/components/SkipDayToggle.tsx": "Button to skip or unskip a workout or diet day, disabled when unauthenticated or pending.",
  "frontend/src/components/ThemeToggle.tsx": "Toggle button that switches between light and dark themes.",
  "frontend/src/components/WaterGlassesTracker.tsx": "Displays daily water intake with increment/decrement buttons using water glasses query hooks.",
  "frontend/src/components/WaterReminderSettings.tsx": "Allows enabling and scheduling a daily water reminder, persisting settings in localStorage.",
  "frontend/src/components/WeeklyDayPicker.tsx": "Renders a 7-day selector grid letting users choose a day index.",
  "frontend/src/components/WeighInForm.tsx": "Modal form for adding a new weight entry using the weight entry mutation.",
  "frontend/src/components/WeighInList.tsx": "Shows recent weight history with dates, using async state handling and weight entry queries.",
  "frontend/src/components/WeightChart.tsx": "Generates a simple SVG line chart of the last 10 weight entries with dynamic scaling.",
  "frontend/src/components/WorkoutDayDetail.tsx": "Displays workout or rest-day details with skip/completion controls and sectioned exercises.",
  "frontend/src/components/WorkoutEditDialog.tsx": "Dialog for editing a day's workout, allowing section/exercise modifications and save/reset actions.",
  "frontend/src/data/mealPlan.ts": "Defines Meal interface and a multi-day meal plan with nutritional details for each meal.",
  "frontend/src/data/workoutPlan.ts": "Defines workout data structures and provides a default multi-day workout plan with sections and exercises.",
  "frontend/src/hooks/queries/queryKeys.ts": "Exports centralized React Query keys, including date-scoped keys for workouts, diet, water, and protein.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Provides a query hook to fetch the authenticated user’s profile using the actor service.",
  "frontend/src/hooks/queries/useDietSkip.ts": "Implements localStorage‑based querying and mutation for tracking whether a user skipped their diet on a given date.",
  "frontend/src/hooks/queries/useProteinScoops.ts": "Provides hooks to read and update protein scoop counts per date using local storage helpers.",
  "frontend/src/hooks/queries/useUserGoals.ts": "Defines mutations to save or update a user profile via the backend actor and invalidates profile queries.",
  "frontend/src/hooks/queries/useWaterGlasses.ts": "Provides hooks to fetch and update daily water glass counts using local storage utilities.",
  "frontend/src/hooks/queries/useWeightEntries.ts": "Implements queries and mutations for weight entries and latest weight using backend actor APIs.",
  "frontend/src/hooks/queries/useWorkoutCompletion.ts": "Provides hooks for workout completion records, stats, and date-scoped completion toggling via the backend.",
  "frontend/src/hooks/queries/useWorkoutForDate.ts": "Fetches or saves custom workouts per date, falling back to default workoutPlan when no override exists.",
  "frontend/src/hooks/queries/useWorkoutSkip.ts": "Adds hooks to query and modify workout-skip status for a date through backend actor methods.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useDietOverrides.ts": "Manages diet overrides per user and date using localStorage with React Query hooks to fetch, save, and reset meal overrides.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for authentication, loading stored identities, and handling login/logout via Dfinity AuthClient.",
  "frontend/src/hooks/useIntervalTimer.ts": "Implements a countdown timer hook with start, pause, reset, and progress tracking using intervals.",
  "frontend/src/hooks/useWaterReminder.ts": "Triggers daily water reminders via toasts and browser notifications at a user‑configured time.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and utility classes.",
  "frontend/src/main.tsx": "App entry point that mounts React, providing React Query and Internet Identity context.",
  "frontend/src/screens/DietScreen.tsx": "Diet management screen showing meals, skip toggles, hydration/protein trackers, and an edit dialog.",
  "frontend/src/screens/HomeScreen.tsx": "Home dashboard showing user goals, workout stats, weight data, and goal editing options.",
  "frontend/src/screens/ProgressScreen.tsx": "Displays weight progress with charts, entry list, and a form to add new weigh‑in entries.",
  "frontend/src/screens/WorkoutScreen.tsx": "Workout screen that shows a selected day's workout, allows editing if authenticated, and displays loading skeletons while fetching data.",
  "frontend/src/utils/date.ts": "Utility functions for formatting, parsing, and manipulating YYYY-MM-DD dates and mapping them to weekdays.",
  "frontend/src/utils/trackerStorage.ts": "LocalStorage utilities for reading and writing per-date water glass and protein scoop counts with anonymous subject fallback.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage support and hash-routing compatibility.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Metadata describing the project’s tracking features, requirements, and pending requests."
}