{
  "kind": "build_request",
  "title": "Add a progress graph chart for workout completion over time",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new chart on the Progress screen to visualize workout progress over time (e.g., a simple bar/line chart showing completed vs not completed per day for the last 30 days), in addition to the existing Weight Progress chart.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "add a graph chart to show my progress"
        ]
      },
      "acceptanceCriteria": [
        "Progress tab shows at least two sections/cards: one for Weight Progress (existing) and one for Workout Progress (new).",
        "Workout Progress chart renders a 30-day timeline visualization using the existing app styling (Tailwind + shadcn Card).",
        "When there is no workout completion data in the selected range, the Workout Progress chart area shows an empty state message in English (e.g., \"No workout progress yet. Complete a workout to start tracking!\").",
        "All user-facing text added for this feature is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a frontend data hook to fetch workout completion status for a date range and use it to power the Workout Progress chart.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "add a graph chart to show my progress"
        ]
      },
      "acceptanceCriteria": [
        "A React Query hook exists that loads workout completion data for a date range (start/end) and provides loading/empty/error states similar to other hooks in the app.",
        "The Workout Progress chart uses this hook and displays a loading state while data is being fetched.",
        "The hook uses centralized query keys (frontend/src/hooks/queries/queryKeys.ts) for caching/invalidations."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix/complete the backend date-range workout completion query so it returns real completion data for the authenticated caller between the provided startDate and endDate (inclusive) instead of hardcoded placeholder dates.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-13"
        ],
        "quotes": [
          "add a graph chart to show my progress"
        ]
      },
      "acceptanceCriteria": [
        "Calling the backend method for workout completions over a date range returns an array of (YYYY-MM-DD, Bool) pairs representing actual stored completion values for the caller for each day in the range.",
        "The method enforces the same authorization rules as other workout completion queries (authenticated user required).",
        "The returned array covers every day in the requested range in chronological order.",
        "No existing weight entry behavior is changed."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add third-party charting libraries (implement with existing React/SVG/Tailwind patterns).",
    "Do not add real-time updates (no websockets/push).",
    "Do not change authentication methods (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}