{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-date water glasses and protein scoops trackers (localStorage + React Query)",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Add a per-date water glasses tracker on the Diet tab with increment/decrement controls and a visible total persisted in localStorage.",
      "acceptanceCriteria": [
        "On the Diet tab, when a user changes the selected date, the water tracker updates to show that date’s saved value.",
        "User can increase and decrease the number of glasses with clear mobile-friendly controls.",
        "The current day’s total is displayed as an integer count (e.g., \"Glasses: 5\").",
        "The value persists across page reloads (localStorage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WaterGlassesTracker.tsx",
          "operation": "create",
          "description": "Create a Diet-tab tracker UI (Card-based) for water glasses that reads/writes the selected date’s value via the new React Query hooks (getter + mutation). Use existing shadcn/ui primitives (e.g., Card, Button) for mobile-friendly +/- controls and a clear integer total display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/DietScreen.tsx",
          "operation": "modify",
          "description": "Wire the WaterGlassesTracker into the Diet tab layout and pass the current selectedDate so the tracker updates when the date changes; keep within existing screen (no new tabs/routes)."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add a per-date protein scoops tracker on the Diet tab with 0/2–2/2 progress UI and quick controls, persisted in localStorage.",
      "acceptanceCriteria": [
        "On the Diet tab, the protein tracker shows progress for the selected date (0/2, 1/2, or 2/2).",
        "User can toggle completion to reach exactly two scoops max, and can undo to reduce the count.",
        "The value persists across page reloads (localStorage)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProteinScoopsTracker.tsx",
          "operation": "create",
          "description": "Create a Diet-tab tracker UI (Card-based) for protein scoops showing explicit progress (0/2, 1/2, 2/2) with quick add/undo controls clamped to [0..2], backed by the new React Query hooks. Use existing shadcn/ui primitives for accessible tap targets. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/DietScreen.tsx",
          "operation": "modify",
          "description": "Wire the ProteinScoopsTracker into the Diet tab layout and pass selectedDate; ensure it updates when the user navigates dates."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Implement React Query query keys and hooks for per-date water glasses and protein scoops values using localStorage keyed by (principal, date) when authenticated and a stable anonymous fallback key otherwise.",
      "acceptanceCriteria": [
        "New query keys exist for water intake per date and protein scoops per date, similar in style to existing date-scoped keys in frontend/src/hooks/queries/queryKeys.ts.",
        "Hooks provide: (1) a getter for a given date and (2) a mutation to update the value, and mutations invalidate the corresponding date-scoped queries.",
        "When authenticated, storage is keyed by the authenticated principal + date; when not authenticated, values still persist locally using an anonymous key + date.",
        "No changes are made to read-only (immutable) frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/queryKeys.ts",
          "operation": "modify",
          "description": "Add new date-scoped React Query keys for water glasses per date and protein scoops per date, matching existing key style and naming consistency."
        },
        {
          "path": "frontend/src/utils/trackerStorage.ts",
          "operation": "create",
          "description": "Add shared localStorage helpers to (a) derive a storage subject key from the authenticated principal when available and (b) create/reuse a stable anonymous subject key when not authenticated, plus helpers to read/write per-(subject,date) values for water glasses and protein scoops."
        },
        {
          "path": "frontend/src/hooks/queries/useWaterGlasses.ts",
          "operation": "create",
          "description": "Implement React Query hooks for water glasses: a date-scoped getter hook and an update mutation hook that persists to localStorage via trackerStorage helpers and invalidates the corresponding date-scoped query key on success."
        },
        {
          "path": "frontend/src/hooks/queries/useProteinScoops.ts",
          "operation": "create",
          "description": "Implement React Query hooks for protein scoops: a date-scoped getter hook and an update mutation hook that persists to localStorage via trackerStorage helpers (clamping to [0..2]) and invalidates the corresponding date-scoped query key on success."
        }
      ]
    }
  ]
}