{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Workout Progress chart on Progress screen (30-day completion timeline)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Workout Progress chart card to the Progress screen showing a 30-day completed vs not completed timeline, alongside the existing Weight Progress chart.",
      "acceptanceCriteria": [
        "Progress tab shows at least two sections/cards: one for Weight Progress (existing) and one for Workout Progress (new).",
        "Workout Progress chart renders a 30-day timeline visualization using the existing app styling (Tailwind + shadcn Card).",
        "When there is no workout completion data in the selected range, the Workout Progress chart area shows an empty state message in English (e.g., \"No workout progress yet. Complete a workout to start tracking!\").",
        "All user-facing text added for this feature is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WorkoutProgressChart.tsx",
          "operation": "create",
          "description": "Create a lightweight (no third-party library) SVG-based 30-day timeline chart component that takes date-indexed completion data and renders completed vs not completed per day using existing Tailwind styling conventions."
        },
        {
          "path": "frontend/src/screens/ProgressScreen.tsx",
          "operation": "modify",
          "description": "Add a new shadcn Card section titled \"Workout Progress\" in addition to the existing \"Weight Progress\" card; compute the last-30-days range (inclusive) and render WorkoutProgressChart within an AsyncState-driven area that supports loading, error, and an empty state message in English when there are no completed workouts in the range."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a React Query hook that loads workout completion status for a start/end date range and use it to power the Workout Progress chart.",
      "acceptanceCriteria": [
        "A React Query hook exists that loads workout completion data for a date range (start/end) and provides loading/empty/error states similar to other hooks in the app.",
        "The Workout Progress chart uses this hook and displays a loading state while data is being fetched.",
        "The hook uses centralized query keys (frontend/src/hooks/queries/queryKeys.ts) for caching/invalidations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/queryKeys.ts",
          "operation": "modify",
          "description": "Add a centralized React Query key generator for workout completions over a date range (start/end) to support caching and invalidation consistency with other hooks."
        },
        {
          "path": "frontend/src/hooks/queries/useWorkoutCompletion.ts",
          "operation": "modify",
          "description": "Add a React Query hook (e.g., useGetWorkoutCompletionsForDateRange) that calls the backend actor’s getWorkoutCompletionsForDateRange(startDate, endDate) and exposes loading/error/data states consistent with existing query hooks (including actor availability gating)."
        },
        {
          "path": "frontend/src/screens/ProgressScreen.tsx",
          "operation": "modify",
          "description": "Wire the new date-range workout completion hook into the Workout Progress section so the chart uses the fetched data and shows AsyncState loading/error/empty states while data is being fetched or when no completion data exists."
        }
      ]
    }
  ]
}